#ifndef _PG_DEX_PARSE_H
#define _PG_DEX_PARSE_H

#include "pub_tool_basics.h"

#include "packergrind.h"
#include "pg_oatparse.h"
#include "pg_framework.h"

#ifndef INLINE
#define INLINE			inline __attribute__((always_inline))
#endif

#ifdef M_PERFORMANCE
#define	OAT_LOGD(fmt, x...) do{}while(0);
#else
#ifdef ONLY_DUMP
#define	OAT_LOGD(fmt, x...) do{}while(0);
#else
#define	OAT_LOGD(fmt, x...) VG_(printf)(fmt, ##x)
#endif
#endif // M_PERFORMANCE

#define	OAT_LOGI(fmt, x...) VG_(printf)(fmt, ##x)
//#define	OAT_LOGI(fmt, x...) do{}while(0)
#define	OAT_LOGE(fmt, x...) VG_(printf)(fmt, ##x)
/* Oat dex file related structures */
#define NO_INDEX 0xffffffff


typedef	UChar			u1;
typedef UShort		u2;
typedef UInt			u4;
typedef ULong			u8;

typedef Char			s1;
typedef Short			s2;
typedef Int				s4;
typedef Long			s8;

#define DEX_MAGIC						"dex\n"
#define DEX_MAGIC_VERS			"035\0"

#define DEX_OPT_MAGIC				"dey\n"
#define DEX_OPT_MAGIC_VERS	"036\0"

#define	DEX_DEP_MAGIC				"deps"


// #define	TRACE_DEX_FILE_DATA	0

/*
 * Single-thread single-string cache. This structure holds a pointer to
 * a string which is semi-automatically manipulated by some of the
 * method prototype functions. Functions which use in this struct
 * generally return a string that is valid until the next
 * time the same DexStringCache is used.
 */
struct DexStringCache {
	HChar* value;          /* the latest value */
	Int allocatedSize; /* size of the allocated buffer, if allocated */
	HChar buffer[120];     /* buffer used to hold small-enough results */
};  

struct DexFileInfo {
	HChar		name[255];	/* name of the dex file */
	ThreadId	tid;				/* Id of the thread which loaded this file */
	Int			fd;					/* fd of the opened file */
	Addr		begin;			/* The beginning address of mapped memory */
	UInt		len;				/* Length of the file in memory */
};

/*
 * Flag for use with createAccessFlagStr().
 */
enum AccessFor {
	kAccessForClass = 0, kAccessForMethod = 1, kAccessForField = 2,
	kAccessForMAX
};

/*
 *  * 160-bit SHA-1 digest.
 *   */
enum { kSHA1DigestLen = 20,
	kSHA1DigestOutputLen = kSHA1DigestLen*2 +1 };

/* annotation constants */
enum {
	kDexVisibilityBuild         = 0x00,     /* annotation visibility */
	kDexVisibilityRuntime       = 0x01,
	kDexVisibilitySystem        = 0x02,

	kDexAnnotationByte          = 0x00,
	kDexAnnotationShort         = 0x02,
	kDexAnnotationChar          = 0x03,
	kDexAnnotationInt           = 0x04,
	kDexAnnotationLong          = 0x06,
	kDexAnnotationFloat         = 0x10,
	kDexAnnotationDouble        = 0x11,
	kDexAnnotationString        = 0x17,
	kDexAnnotationType          = 0x18,
	kDexAnnotationField         = 0x19,
	kDexAnnotationMethod        = 0x1a,
	kDexAnnotationEnum          = 0x1b,
	kDexAnnotationArray         = 0x1c,
	kDexAnnotationAnnotation    = 0x1d,
	kDexAnnotationNull          = 0x1e,
	kDexAnnotationBoolean       = 0x1f,

	kDexAnnotationValueTypeMask = 0x1f,     /* low 5 bits */
	kDexAnnotationValueArgShift = 5,
};

/* map item type codes */
enum {
	kDexTypeHeaderItem               = 0x0000,
	kDexTypeStringIdItem             = 0x0001,
	kDexTypeTypeIdItem               = 0x0002,
	kDexTypeProtoIdItem              = 0x0003,
	kDexTypeFieldIdItem              = 0x0004,
	kDexTypeMethodIdItem             = 0x0005,
	kDexTypeClassDefItem             = 0x0006,
	kDexTypeMapList                  = 0x1000,
	kDexTypeTypeList                 = 0x1001,
	kDexTypeAnnotationSetRefList     = 0x1002,
	kDexTypeAnnotationSetItem        = 0x1003,
	kDexTypeClassDataItem            = 0x2000,
	kDexTypeCodeItem                 = 0x2001,
	kDexTypeStringDataItem           = 0x2002,
	kDexTypeDebugInfoItem            = 0x2003,
	kDexTypeAnnotationItem           = 0x2004,
	kDexTypeEncodedArrayItem         = 0x2005,
	kDexTypeAnnotationsDirectoryItem = 0x2006,
};

/* auxillary data section chunk codes */
enum {
	kDexChunkClassLookup            = 0x434c4b50,   /* CLKP */
	kDexChunkRegisterMaps           = 0x524d4150,   /* RMAP */

	kDexChunkEnd                    = 0x41454e44,   /* AEND */
};

/* debug info opcodes and constants */
enum {
	DBG_END_SEQUENCE         = 0x00,
	DBG_ADVANCE_PC           = 0x01,
	DBG_ADVANCE_LINE         = 0x02,
	DBG_START_LOCAL          = 0x03,
	DBG_START_LOCAL_EXTENDED = 0x04,
	DBG_END_LOCAL            = 0x05,
	DBG_RESTART_LOCAL        = 0x06,
	DBG_SET_PROLOGUE_END     = 0x07,
	DBG_SET_EPILOGUE_BEGIN   = 0x08,
	DBG_SET_FILE             = 0x09,
	DBG_FIRST_SPECIAL        = 0x0a,
	DBG_LINE_BASE            = -4,
	DBG_LINE_RANGE           = 15,
};

/* general constants */
enum {
	kDexEndianConstant = 0x12345678,    /* the endianness indicator */
	kDexNoIndex = 0xffffffff,           /* not a valid index value */
};

/*
 * access flags and masks; the "standard" ones are all <= 0x4000
 *
 * Note: There are related declarations in vm/oo/Object.h in the ClassFlags
 * enum.
 */
enum {
	ACC_PUBLIC       = 0x00000001,       // class, field, method, ic
	ACC_PRIVATE      = 0x00000002,       // field, method, ic
	ACC_PROTECTED    = 0x00000004,       // field, method, ic
	ACC_STATIC       = 0x00000008,       // field, method, ic
	ACC_FINAL        = 0x00000010,       // class, field, method, ic
	ACC_SYNCHRONIZED = 0x00000020,       // method (only allowed on natives)
	ACC_SUPER        = 0x00000020,       // class (not used in Dalvik)
	ACC_VOLATILE     = 0x00000040,       // field
	ACC_BRIDGE       = 0x00000040,       // method (1.5)
	ACC_TRANSIENT    = 0x00000080,       // field
	ACC_VARARGS      = 0x00000080,       // method (1.5)
	ACC_NATIVE       = 0x00000100,       // method
	ACC_INTERFACE    = 0x00000200,       // class, ic
	ACC_ABSTRACT     = 0x00000400,       // class, method, ic
	ACC_STRICT       = 0x00000800,       // method
	ACC_SYNTHETIC    = 0x00001000,       // field, method, ic
	ACC_ANNOTATION   = 0x00002000,       // class, ic (1.5)
	ACC_ENUM         = 0x00004000,       // class, field, ic (1.5)
	ACC_CONSTRUCTOR  = 0x00010000,       // method (Dalvik only)
	ACC_DECLARED_SYNCHRONIZED =
		0x00020000,       // method (Dalvik only)
	ACC_CLASS_MASK =
		(ACC_PUBLIC | ACC_FINAL | ACC_INTERFACE | ACC_ABSTRACT
		 | ACC_SYNTHETIC | ACC_ANNOTATION | ACC_ENUM),
	ACC_INNER_CLASS_MASK =
		(ACC_CLASS_MASK | ACC_PRIVATE | ACC_PROTECTED | ACC_STATIC),
	ACC_FIELD_MASK =
		(ACC_PUBLIC | ACC_PRIVATE | ACC_PROTECTED | ACC_STATIC | ACC_FINAL
		 | ACC_VOLATILE | ACC_TRANSIENT | ACC_SYNTHETIC | ACC_ENUM),
	ACC_METHOD_MASK =
		(ACC_PUBLIC | ACC_PRIVATE | ACC_PROTECTED | ACC_STATIC | ACC_FINAL
		 | ACC_SYNCHRONIZED | ACC_BRIDGE | ACC_VARARGS | ACC_NATIVE
		 | ACC_ABSTRACT | ACC_STRICT | ACC_SYNTHETIC | ACC_CONSTRUCTOR
		 | ACC_DECLARED_SYNCHRONIZED),
};


/*
 * Direct-mapped "header_item" struct.
 */
struct DexHeader { /* 112 bytes */
	/* 00 */UChar  magic[8];           /* includes version number */
	/* 08 */UInt  checksum;           /* adler32 checksum */
	/* 0c */UChar  signature[kSHA1DigestLen]; /* SHA-1 hash */
	/* 20 */UInt  fileSize;           /* length of entire file */
	/* 24 */UInt  headerSize;         /* offset to start of next section */
	/* 28 */UInt  endianTag;
	/* 2c */UInt  linkSize;
	/* 30 */UInt  linkOff;
	/* 34 */UInt  mapOff;
	/* 38 */UInt  stringIdsSize;
	/* 3c */UInt  stringIdsOff;
	/* 40 */UInt  typeIdsSize;
	/* 44 */UInt  typeIdsOff;
	/* 48 */UInt  protoIdsSize;
	/* 4c */UInt  protoIdsOff;
	/* 50 */UInt  fieldIdsSize;
	/* 54 */UInt  fieldIdsOff;
	/* 58 */UInt  methodIdsSize;
	/* 5c */UInt  methodIdsOff;
	/* 60 */UInt  classDefsSize;
	/* 64 */UInt  classDefsOff;
	/* 68 */UInt  dataSize;
	/* 6c */UInt  dataOff;
};

#if 0
struct DexHeader {
	UChar	magic[8];
	UInt  checksum;
	UChar signature[20];
	UInt  fileSize;
	UInt  headerSize;
	UInt  endianTag;
	UInt  linkSize;
	UInt  linkOff;
	UInt  mapOff;
	UInt  stringIdsSize;
	UInt  stringIdsOff;
	UInt  typeIdsSize;
	UInt  typeIdsOff;
	UInt  protoIdsSize;
	UInt  protoIdsOff;
	UInt  fieldIdsSize;
	UInt  fieldIdsOff;
	UInt  methodIdsSize;
	UInt  methodIdsOff;
	UInt  classDefsSize;
	UInt  classDefsOff;
	UInt  dataSize;
	UInt  dataOff;
};
#endif


/*
 * Direct-mapped "map_item".
 */
struct DexMapItem {
	UShort type;              /* type code (see kDexType* above) */
	UShort unused;
	UInt	 size;              /* count of items of the indicated type */
	UInt	 offset;            /* file offset to the start of data */
};

/*
 * Direct-mapped "map_list".
 */
struct DexMapList {
	UInt  size;			               /* #of entries in list */
	struct DexMapItem list[1];     /* entries */
};

/*
 * Direct-mapped "class_def_item".
 */
// 32bytes
struct DexClassDef {
	/*0x00*/ UInt  classIdx;           /* index into typeIds for this class */
	/*0x04*/ UInt  accessFlags;
	/*0x08*/ UInt  superclassIdx;      /* index into typeIds for superclass */
	/*0x0c*/ UInt  interfacesOff;      /* file offset to DexTypeList */
	/*0x10*/ UInt  sourceFileIdx;      /* index into stringIds for source file name */
	/*0x14*/ UInt  annotationsOff;     /* file offset to annotations_directory_item */
	/*0x18*/ UInt  classDataOff;       /* file offset to class_data_item */
	/*0x1c*/ UInt  staticValuesOff;    /* file offset to DexEncodedArray */
};

#if 0
struct DexClassDef {
	UInt  classIdx;
	UInt  accessFlags;
	UInt  superClassIdx;
	UInt  interfaceOff;
	UInt  sourceFileIdx;
	UInt  annotationsOff;
	UInt  classDataOff;
	UInt  staticValuesOff;
};
#endif

struct DexMethodId {
	UShort  classIdx;
	UShort  protoIdx;
	UInt		nameIdx;
};

/*
 * Direct-mapped "proto_id_item".
 */
struct DexProtoId {
	UInt  shortyIdx;          /* index into stringIds for shorty descriptor */
	UInt  returnTypeIdx;      /* index into typeIds list for return type */
	UInt  parametersOff;      /* file offset to type_list for parameter types */
};

struct DexFieldId {
	UShort classIdx;
	UShort typeIdx;
	UInt   nameIdx;
};

struct DexStringId {
	UInt stringDataOff;
};

struct DexTypeId {
	UInt descriptorIdx;
};

struct DexTypeItem {
	UShort typeIdx;				// index into type_ids section
};

struct DexTypeList {
	UInt size;						// size of the list, in entries
